app/controllers/mantenedors_controller.rb

SELECT "mantenedors".* FROM "mantenedors"
---
  def index
    @mantenedors = Mantenedor.all

DELETE FROM "mantenedors" WHERE "mantenedors"."id" = $1  [["id", 1]]
---
  def destroy
    @mantenedor.destroy

SELECT "mantenedors".* FROM "mantenedors" WHERE "mantenedors"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_mantenedor
      @mantenedor = Mantenedor.find(params[:id])